fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеДокументовРеализацияТоваровИУслуг/ВКМ_МассовоеСозданиеДокументовРеализацияТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеДокументовРеализацияТоваровИУслуг</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СозданныеДокументы</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРеализацияТоваровИУслуг</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <basedOn>Catalog.ДоговорыКонтрагентов</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеДокументовРеализацияТоваровИУслуг/ManagerModule.bsl
Функция ВыполнитьСозданиеДокументовРеализация(НачалоПериода, КонецПериода) Экспорт
	
	ЗапросДоговоровССозданнымиРеализациями = Новый Запрос;
	
	ЗапросДоговоровССозданнымиРеализациями.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслуг.Договор
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата > &НачалоПериода
	|	И РеализацияТоваровУслуг.Дата < &КонецПериода
	|	И РеализацияТоваровУслуг.ПометкаУдаления = &ПометкаУдаления";
	
	ЗапросДоговоровССозданнымиРеализациями.УстановитьПараметр("НачалоПериода", НачалоПериода);
	ЗапросДоговоровССозданнымиРеализациями.УстановитьПараметр("КонецПериода", КонецПериода);
	ЗапросДоговоровССозданнымиРеализациями.УстановитьПараметр("ПометкаУдаления", ЛОЖЬ);
		
	МассивДоговоровССозданнымиРеализациями = ЗапросДоговоровССозданнымиРеализациями.Выполнить().Выгрузить().ВыгрузитьКолонку("Договор");	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договоры
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|	И ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействия < &КонецПериода
	|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействия > &НачалоПериода
	|	И ДоговорыКонтрагентов.Ссылка НЕ В (&МассивДоговоровССозданнымиРеализациями)
	|	И ДоговорыКонтрагентов.ПометкаУдаления = &ПометкаУдаления";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("МассивДоговоровССозданнымиРеализациями", МассивДоговоровССозданнымиРеализациями);
	Запрос.УстановитьПараметр("ПометкаУдаления", ЛОЖЬ);
		
	ТЗРезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	КоличествоДокументовДляСоздания = ТзРезультатЗапроса.Количество();

	МассивСозданныхДокументов = Новый Массив;	
	
		Сч = 1;
				
		Для каждого Договор Из ТЗРезультатЗапроса Цикл
		
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Заполнить(Договор.Договоры);
			НовыйДокумент.Дата = НачалоПериода;
			НовыйДокумент.СуммаДокумента = 1;
			Если НовыйДокумент.ПроверитьЗаполнение() Тогда
				НовыйДокумент.Записать(РежимЗаписиДокумента.Запись,);
				СсылкаНаСозданнуюРеализацию = НовыйДокумент.Ссылка;
				ДокументОбъект = СсылкаНаСозданнуюРеализацию.ПолучитьОбъект();
				ДокументОбъект.ВКМ_ВыполнитьАвтозаполнение();
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись,);
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение,);
			НовыйДокументРеализация = Новый Структура;
			НовыйДокументРеализация.Вставить("Договор", Договор.Договоры);
			НовыйДокументРеализация.Вставить("РеализацияТоваровИУслуг", СсылкаНаСозданнуюРеализацию);
			МассивСозданныхДокументов.Добавить(НовыйДокументРеализация);
			Иначе 
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = СтрШаблон("Не удалось записать документ по договору %1. Произошла ошибка при заполнении обязательных данных.", Договор.Договоры);
				Сообщение.Сообщить();

			Продолжить;
				
			КонецЕсли;
			
			Сч = Сч + 1;
						
			ДлительныеОперации.СообщитьПрогресс(((Сч-1)/КоличествоДокументовДляСоздания)*100);
		
		КонецЦикла;
		
		Возврат МассивСозданныхДокументов;
	
КонецФункции
